app/controllers/auth_controller.rb

  def create

    @user = User.find_by(username: user_login_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]