app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user.update(update_params)
---
UPDATE "users" SET "tag_line" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["tag_line", "Checkout"], ["updated_at", "2019-05-24 19:53:40.931987"], ["id", 1]]

  def addGame
    user = User.find(params[:user][:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]